feat: rewrite some documents and integrated VitePress for documentation site building (#5)
* doc: redesign and rewrite the api and guide series of documents

* feat(admin): support to view workload info in agent admin dashboard

* chore: import vitepress to build docs package io

* doc(README): update logo icon

* fix(agent): fix XSS Cross-site scripting security problem

* fix(admin): wrong display style of kid of public key of WIT

* doc(README): update latest images of README and fix wrong style of CN README.zh-CN.md

* feat(agent): optimize agent prompt design in Qwen scene

* doc: optimize document page render

* feat(login): remove the non-standard mechanism of embedding sessionId through the OAuth state parameter in the User Authentication scenario, and the login state is maintained in the standard session/cookie manner instead

* test: update E2E integration test after user IDP session process optimization

* test: add more unit tests to improve code coverage

* test: fix failed unit tests

* test: fix omissive failed unit tests

* feat(admin): add access control for admin dashboard page

* doc(readme): fix wrong document link in the README

* doc(admin): add document for admin dashboard

* doc(logo): remove repeated logo

* feat: revise wrong audit event process
